import Vue from 'vue';
import Vuex from 'vuex';
import axios from 'axios';
// import Joi from 'joi';

Vue.use(Vuex)
// const resourceHost = 'http://localhost:3000'

import styles from './assets/styles.json';
const defaultColor = "default";
const DBoptions = {
  showEmpty: false,
  showForeign: false
};

export default new Vuex.Store({
  state: {
    test: false,

    auth: {
      id:null, accessLevel:0, userName:null,
      // id: '2018317024', accessLevel: 3, userName: "김건",
    },
    mode: 'search', // search  admin
    dbinfo: {},

    searchArr: [],
    testArr: [
      {
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈1',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 708,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈2',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 709,
        '19_1': 1,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 710,
        '19_1': 2,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 711,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 712,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 713,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 714,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 715,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 716,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 717,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 718,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 719,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 720,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 721,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 722,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 723,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 724,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 725,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 726,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 727,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 728,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 729,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 730,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 731,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 732,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      },{
        room_id: 408,
        room_name: 'A0532B',
        student_name: '이호빈3',
        building: 'A',
        seat: 'B',
        term: 'YY',
        student_number: '2019117029',
        faculty: '공과대학',
        major: '건축공학과',
        phone: '010-9339-0689',
        indate: '2020/02/29',
        student_id: 733,
        '19_1': 0,
        '19_2': 0,
        '19_3': 0,
        '19_4': 0,
        '19_5': 0,
        '19_6': 0,
        '19_7': 0,
        '19_8': 0,
        '19_9': 0,
        '19_10': 0,
        '19_11': 0,
        '19_12': 0,
        '20_1': 0,
        '20_2': 0,
        '20_3': 0
      }
    ],
    search: {
      keyword: '',
      moreinfo: false,
      recordHeight: 66,
      coverBottom: { "height": "100%" },
      loadingState: 0
    },
    
    roomList: [],
    roomTest: [
      { "room": "A0101", 
        "A": { "room_id": 1, "room_name": "A0101A", "building": "A", "floor": "01", "room_number": "01", "seat": "A", "student_name": "임정현", "term": "YY", "student_number": "211160022", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-2276-8974", "indate": "2020/02/29", "serial_number": "200102M211160022", "student_id": 726, "19_1": 2, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 2, "room_name": "A0101B", "building": "A", "floor": "01", "room_number": "01", "seat": "B", "student_name": "이대희", "term": "YY", "student_number": "331150018", "faculty": "공과대학", "major": "화학공학과", "phone": "010-8241-8393", "indate": "2020/02/29", "serial_number": "200102M331150018", "student_id": 600, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0102", "A": { "room_id": 3, "room_name": "A0102A", "building": "A", "floor": "01", "room_number": "02", "seat": "A", "student_name": "이동헌", "term": "YY", "student_number": "311150134", "faculty": "공과대학", "major": "건축학과", "phone": "010-8393-0725", "indate": "2020/02/29", "serial_number": "200102M311150134", "student_id": 604, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 4, "room_name": "A0102B", "building": "A", "floor": "01", "room_number": "02", "seat": "B", "student_name": "정원빈", "term": "YY", "student_number": "531150257", "faculty": "인문사회과학대학", "major": "미디어영상학부", "phone": "010-7229-0246", "indate": "2020/02/29", "serial_number": "200102M531150257", "student_id": 785, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0103", "A": { "room_id": 5, "room_name": "A0103A", "building": "A", "floor": "01", "room_number": "03", "seat": "A", "student_name": "박제영", "term": "YY", "student_number": "211160116", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-2257-6289", "indate": "2020/02/29", "serial_number": "200102M211160116", "student_id": 355, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 6, "room_name": "A0103B", "building": "A", "floor": "01", "room_number": "03", "seat": "B", "student_name": "송준홍", "term": "YY", "student_number": "121150060", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-3810-5930", "indate": "2020/02/29", "serial_number": "200102M121150060", "student_id": 458, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0104", "A": { "room_id": 7, "room_name": "A0104A", "building": "A", "floor": "01", "room_number": "04", "seat": "A", "student_name": "김승원", "term": "YY", "student_number": "121150010", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-8334-4826", "indate": "2020/02/29", "serial_number": "200102M121150010", "student_id": 157, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 8, "room_name": "A0104B", "building": "A", "floor": "01", "room_number": "04", "seat": "B", "student_name": "김현규", "term": "YY", "student_number": "231160032", "faculty": "소프트웨어융합대학", "major": "정보융합학부", "phone": "010-5570-4345", "indate": "2020/02/29", "serial_number": "200102M231160032", "student_id": 228, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0105", "A": { "room_id": 9, "room_name": "A0105A", "building": "A", "floor": "01", "room_number": "05", "seat": "A", "student_name": "정서원", "term": "YY", "student_number": "711150226", "faculty": "경영대학", "major": "경영학부", "phone": "010-2796-8841", "indate": "2020/02/29", "serial_number": "200102M711150226", "student_id": 774, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 10, "room_name": "A0105B", "building": "A", "floor": "01", "room_number": "05", "seat": "B", "student_name": "이준서", "term": "YY", "student_number": "331190019", "faculty": "공과대학", "major": "화학공학과", "phone": "010-8999-7293", "indate": "2020/02/29", "serial_number": "200102M331190019", "student_id": 673, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0106", "A": { "room_id": 11, "room_name": "A0106A", "building": "A", "floor": "01", "room_number": "06", "seat": "A", "student_name": "이승하", "term": "YY", "student_number": "621190002", "faculty": "정책법학대학", "major": "법학부", "phone": "010-3925-1315", "indate": "2020/02/29", "serial_number": "200102M621190002", "student_id": 632, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 12, "room_name": "A0106B", "building": "A", "floor": "01", "room_number": "06", "seat": "B", "student_name": "하성훈", "term": "YY", "student_number": "716110003", "faculty": "경영대학", "major": "경영학부", "phone": "010-8370-4236", "indate": "2020/02/29", "serial_number": "200102M716110003", "student_id": 908, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0107", "A": { "room_id": 13, "room_name": "A0107A", "building": "A", "floor": "01", "room_number": "07", "seat": "A", "student_name": "박정훈", "term": "YY", "student_number": "212290089", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-3256-3696", "indate": "2020/02/29", "serial_number": "200102M212290089", "student_id": 354, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 14, "room_name": "A0107B", "building": "A", "floor": "01", "room_number": "07", "seat": "B", "student_name": "박경민", "term": "YY", "student_number": "421150004", "faculty": "자연과학대학", "major": "전자바이오물리학과", "phone": "010-5652-3193", "indate": "2020/02/29", "serial_number": "200102M421150004", "student_id": 299, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0108", "A": { "room_id": 15, "room_name": "A0108A", "building": "A", "floor": "01", "room_number": "08", "seat": "A", "student_name": "권성훈", "term": "YY", "student_number": "711150242", "faculty": "경영대학", "major": "경영학부", "phone": "010-8726-8418", "indate": "2020/02/29", "serial_number": "200102M711150242", "student_id": 56, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 16, "room_name": "A0108B", "building": "A", "floor": "01", "room_number": "08", "seat": "B", "student_name": "문건웅", "term": "YY", "student_number": "141150021", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-7454-9020", "indate": "2020/02/29", "serial_number": "200102M141150021", "student_id": 291, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0109", "A": { "room_id": 17, "room_name": "A0109A", "building": "A", "floor": "01", "room_number": "09", "seat": "A", "student_name": "박종권", "term": "YY", "student_number": "311180014", "faculty": "공과대학", "major": "건축학과", "phone": "010-8556-5139", "indate": "2020/02/29", "serial_number": "200102M311180014", "student_id": 356, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 18, "room_name": "A0109B", "building": "A", "floor": "01", "room_number": "09", "seat": "B", "student_name": "신성민", "term": "YY", "student_number": "211160026", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-9009-0158", "indate": "2020/02/29", "serial_number": "200102M211160026", "student_id": 466, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0110", "A": { "room_id": 19, "room_name": "A0110A", "building": "A", "floor": "01", "room_number": "10", "seat": "A", "student_name": "유완승", "term": "YY", "student_number": "111150220", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-5632-2015", "indate": "2020/02/29", "serial_number": "200102M111150220", "student_id": 551, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 20, "room_name": "A0110B", "building": "A", "floor": "01", "room_number": "10", "seat": "B", "student_name": "신승빈", "term": "YY", "student_number": "151260020", "faculty": "전자정보공과대학", "major": "전자재료공학과", "phone": "010-8208-4413", "indate": "2020/02/29", "serial_number": "200102M151260020", "student_id": 467, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0111", "A": { "room_id": 21, "room_name": "A0111A", "building": "A", "floor": "01", "room_number": "11", "seat": "A", "student_name": "박준모", "term": "YY", "student_number": "151170017", "faculty": "전자정보공과대학", "major": "전자재료공학과", "phone": "010-2652-3666", "indate": "2020/02/29", "serial_number": "200102M151170017", "student_id": 360, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 22, "room_name": "A0111B", "building": "A", "floor": "01", "room_number": "11", "seat": "B", "student_name": "조민석", "term": "YY", "student_number": "531150345", "faculty": "인문사회과학대학", "major": "미디어영상학부", "phone": "010-5648-1030", "indate": "2020/02/29", "serial_number": "200102M531150345", "student_id": 815, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0112", "A": { "room_id": 23, "room_name": "A0112A", "building": "A", "floor": "01", "room_number": "12", "seat": "A", "student_name": "권승훈", "term": "YY", "student_number": "111150252", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-5513-0541", "indate": "2020/02/29", "serial_number": "200102M111150252", "student_id": 61, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 24, "room_name": "A0112B", "building": "A", "floor": "01", "room_number": "12", "seat": "B", "student_name": "배준현", "term": "YY", "student_number": "131150073", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-2053-1106", "indate": "2020/02/29", "serial_number": "200102M131150073", "student_id": 392, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0113", "A": { "room_id": 25, "room_name": "A0113A", "building": "A", "floor": "01", "room_number": "13", "seat": "A", "student_name": "박근홍", "term": "YY", "student_number": "321260103", "faculty": "공과대학", "major": "건축공학과", "phone": "010-2861-8445", "indate": "2020/02/29", "serial_number": "200102M321260103", "student_id": 306, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 26, "room_name": "A0113B", "building": "A", "floor": "01", "room_number": "13", "seat": "B", "student_name": "황준우", "term": "YY", "student_number": "141260199", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-9973-6080", "indate": "2020/02/29", "serial_number": "200102M141260199", "student_id": 964, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0114", "A": { "room_id": 27, "room_name": "A0114A", "building": "A", "floor": "01", "room_number": "14", "seat": "A", "student_name": "윤태영", "term": "YY", "student_number": "151260302", "faculty": "전자정보공과대학", "major": "전자재료공학과", "phone": "010-2265-2574", "indate": "2020/02/29", "serial_number": "200102M151260302", "student_id": 580, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 28, "room_name": "A0114B", "building": "A", "floor": "01", "room_number": "14", "seat": "B", "student_name": "김인송", "term": "YY", "student_number": "211250012", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-2184-0516", "indate": "2020/02/29", "serial_number": "200102M211250012", "student_id": 185, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0115", "A": { "room_id": 29, "room_name": "A0115A", "building": "A", "floor": "01", "room_number": "15", "seat": "A", "student_name": "허창민", "term": "YY", "student_number": "221150118", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-2749-0782", "indate": "2020/02/29", "serial_number": "200102M221150118", "student_id": 934, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 30, "room_name": "A0115B", "building": "A", "floor": "01", "room_number": "15", "seat": "B", "student_name": "임동언", "term": "YY", "student_number": "331260096", "faculty": "공과대학", "major": "화학공학과", "phone": "010-6605-8231", "indate": "2020/02/29", "serial_number": "200102M331260096", "student_id": 715, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0116", "A": { "room_id": 31, "room_name": "A0116A", "building": "A", "floor": "01", "room_number": "16", "seat": "A", "student_name": " 안희범", "term": "YY", "student_number": "711150374", "faculty": "경영대학", "major": "경영학부", "phone": "010-4917-0346", "indate": "2020/02/29", "serial_number": "200102M711150374", "student_id": 1, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 32, "room_name": "A0116B", "building": "A", "floor": "01", "room_number": "16", "seat": "B", "student_name": "윤어진", "term": "YY", "student_number": "551250046", "faculty": "인문사회과학대학", "major": "동북아문화산업학부", "phone": "010-5754-9911", "indate": "2020/02/29", "serial_number": "200102M551250046", "student_id": 572, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0117", "A": { "room_id": 33, "room_name": "A0117A", "building": "A", "floor": "01", "room_number": "17", "seat": "A", "student_name": "정민혁", "term": "YY", "student_number": "551150018", "faculty": "인문사회과학대학", "major": "동북아문화산업학부", "phone": "010-9071-6190", "indate": "2020/02/29", "serial_number": "200102M551150018", "student_id": 773, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 34, "room_name": "A0117B", "building": "A", "floor": "01", "room_number": "17", "seat": "B", "student_name": "황태수", "term": "YY", "student_number": "624290103", "faculty": "정책법학대학", "major": "법학부", "phone": "010-9373-2862", "indate": "2020/02/29", "serial_number": "200102M624290103", "student_id": 965, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0118", "A": { "room_id": 35, "room_name": "A0118A", "building": "A", "floor": "01", "room_number": "18", "seat": "A", "student_name": "박근도", "term": "YY", "student_number": "541150051", "faculty": "인문사회과학대학", "major": "산업심리학과", "phone": "010-2372-8750", "indate": "2020/02/29", "serial_number": "200102M541150051", "student_id": 305, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 36, "room_name": "A0118B", "building": "A", "floor": "01", "room_number": "18", "seat": "B", "student_name": "박진수", "term": "YY", "student_number": "131150003", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-5124-5620", "indate": "2020/02/29", "serial_number": "200102M131150003", "student_id": 370, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0119", "A": { "room_id": 37, "room_name": "A0119A", "building": "A", "floor": "01", "room_number": "19", "seat": "A", "student_name": "송원대", "term": "YY", "student_number": "531150440", "faculty": "인문사회과학대학", "major": "미디어커뮤니케이션학부", "phone": "010-9519-0395", "indate": "2020/02/29", "serial_number": "200102M531150440", "student_id": 453, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 38, "room_name": "A0119B", "building": "A", "floor": "01", "room_number": "19", "seat": "B", "student_name": "강태웅", "term": "YY", "student_number": "211150189", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-2313-1184", "indate": "2020/02/29", "serial_number": "200102M211150189", "student_id": 24, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0120", "A": { "room_id": 39, "room_name": "A0120A", "building": "A", "floor": "01", "room_number": "20", "seat": "A", "student_name": "박상천", "term": "YY", "student_number": "221150221", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-3593-5474", "indate": "2020/02/29", "serial_number": "200102M221150221", "student_id": 318, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 40, "room_name": "A0120B", "building": "A", "floor": "01", "room_number": "20", "seat": "B", "student_name": "조훈", "term": "YY", "student_number": "431150046", "faculty": "자연과학대학", "major": "화학과", "phone": "010-9855-8161", "indate": "2020/02/29", "serial_number": "200102M431150046", "student_id": 842, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0121", "A": { "room_id": 41, "room_name": "A0121A", "building": "A", "floor": "01", "room_number": "21", "seat": "A", "student_name": "윤식", "term": "YY", "student_number": "121150062", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-4308-2466", "indate": "2020/02/29", "serial_number": "200102M121150062", "student_id": 571, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 42, "room_name": "A0121B", "building": "A", "floor": "01", "room_number": "21", "seat": "B", "student_name": "이재현", "term": "YY", "student_number": "111150318", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-8473-9110", "indate": "2020/02/29", "serial_number": "200102M111150318", "student_id": 661, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0122", "A": { "room_id": 43, "room_name": "A0122A", "building": "A", "floor": "01", "room_number": "22", "seat": "A", "student_name": "이준호", "term": "YY", "student_number": "221260231", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-4622-4228", "indate": "2020/02/29", "serial_number": "200102M221260231", "student_id": 676, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 44, "room_name": "A0122B", "building": "A", "floor": "01", "room_number": "22", "seat": "B", "student_name": "조현준", "term": "YY", "student_number": "141250014", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-2808-5510", "indate": "2020/02/29", "serial_number": "200102M141250014", "student_id": 840, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0123", "A": { "room_id": 45, "room_name": "A0123A", "building": "A", "floor": "01", "room_number": "23", "seat": "A", "student_name": null, "term": null, "student_number": null, "faculty": null, "major": null, "phone": null, "indate": null, "serial_number": null, "student_id": null, "19_1": null, "19_2": null, "19_3": null, "19_4": null, "19_5": null, "19_6": null, "19_7": null, "19_8": null, "19_9": null, "19_10": null, "19_11": null, "19_12": null, "20_1": null, "20_2": null, "20_3": null }, "B": { "room_id": 46, "room_name": "A0123B", "building": "A", "floor": "01", "room_number": "23", "seat": "B", "student_name": null, "term": null, "student_number": null, "faculty": null, "major": null, "phone": null, "indate": null, "serial_number": null, "student_id": null, "19_1": null, "19_2": null, "19_3": null, "19_4": null, "19_5": null, "19_6": null, "19_7": null, "19_8": null, "19_9": null, "19_10": null, "19_11": null, "19_12": null, "20_1": null, "20_2": null, "20_3": null } }, { "room": "A0124", "A": { "room_id": 47, "room_name": "A0124A", "building": "A", "floor": "01", "room_number": "24", "seat": "A", "student_name": "김재웅", "term": "YY", "student_number": "2013706113", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-3395-5737", "indate": "2020/02/29", "serial_number": "200101M2013706113", "student_id": 186, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 48, "room_name": "A0124B", "building": "A", "floor": "01", "room_number": "24", "seat": "B", "student_name": "강민성", "term": "YY", "student_number": "2015706044", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-6231-4539", "indate": "2020/02/29", "serial_number": "200101M2015706044", "student_id": 9, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0125", "A": { "room_id": 49, "room_name": "A0125A", "building": "A", "floor": "01", "room_number": "25", "seat": "A", "student_name": "임승빈", "term": "YY", "student_number": "2015742040", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-3743-2293", "indate": "2020/02/29", "serial_number": "200101M2015742040", "student_id": 720, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 50, "room_name": "A0125B", "building": "A", "floor": "01", "room_number": "25", "seat": "B", "student_name": "박현서", "term": "YY", "student_number": "2016722070", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-5225-3160", "indate": "2020/02/29", "serial_number": "200101M2016722070", "student_id": 381, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0126", "A": { "room_id": 51, "room_name": "A0126A", "building": "A", "floor": "01", "room_number": "26", "seat": "A", "student_name": "박선기", "term": "YY", "student_number": "2016117027", "faculty": "공과대학", "major": "건축공학과", "phone": "010-2058-1656", "indate": "2020/02/29", "serial_number": "200101M2016117027", "student_id": 324, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 52, "room_name": "A0126B", "building": "A", "floor": "01", "room_number": "26", "seat": "B", "student_name": "이기완", "term": "YY", "student_number": "2015707080", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-9974-4315", "indate": "2020/02/29", "serial_number": "200101M2015707080", "student_id": 595, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0127", "A": { "room_id": 53, "room_name": "A0127A", "building": "A", "floor": "01", "room_number": "27", "seat": "A", "student_name": "박종민", "term": "YY", "student_number": "2015726090", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-3226-4561", "indate": "2020/02/29", "serial_number": "200101M2015726090", "student_id": 357, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 54, "room_name": "A0127B", "building": "A", "floor": "01", "room_number": "27", "seat": "B", "student_name": "김태영", "term": "YY", "student_number": "2016741023", "faculty": "전자정보공과대학", "major": "로봇학부", "phone": "010-9686-8177", "indate": "2020/02/29", "serial_number": "200101M2016741023", "student_id": 218, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0128", "A": { "room_id": 55, "room_name": "A0128A", "building": "A", "floor": "01", "room_number": "28", "seat": "A", "student_name": "임유섭", "term": "YY", "student_number": "2015722022", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-9431-9318", "indate": "2020/02/29", "serial_number": "200101M2015722022", "student_id": 724, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 56, "room_name": "A0128B", "building": "A", "floor": "01", "room_number": "28", "seat": "B", "student_name": "손창환", "term": "YY", "student_number": "2015726032", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-3188-5281", "indate": "2020/02/29", "serial_number": "200101M2015726032", "student_id": 445, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0129", "A": { "room_id": 57, "room_name": "A0129A", "building": "A", "floor": "01", "room_number": "29", "seat": "A", "student_name": "김우현", "term": "YY", "student_number": "2016114017", "faculty": "공과대학", "major": "화학공학과", "phone": "010-4895-3435", "indate": "2020/02/29", "serial_number": "200101M2016114017", "student_id": 177, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 58, "room_name": "A0129B", "building": "A", "floor": "01", "room_number": "29", "seat": "B", "student_name": "이항영", "term": "YY", "student_number": "2016722042", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-7233-5405", "indate": "2020/02/29", "serial_number": "200101M2016722042", "student_id": 700, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0130", "A": { "room_id": 59, "room_name": "A0130A", "building": "A", "floor": "01", "room_number": "30", "seat": "A", "student_name": "신필규", "term": "YY", "student_number": "2016803061", "faculty": "정책법학대학", "major": "법학부", "phone": "010-4039-8982", "indate": "2020/02/29", "serial_number": "200101M2016803061", "student_id": 474, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 60, "room_name": "A0130B", "building": "A", "floor": "01", "room_number": "30", "seat": "B", "student_name": "이원형", "term": "YY", "student_number": "2015722055", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-7108-3023", "indate": "2020/02/29", "serial_number": "200101M2015722055", "student_id": 649, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0131", "A": { "room_id": 61, "room_name": "A0131A", "building": "A", "floor": "01", "room_number": "31", "seat": "A", "student_name": "선현수", "term": "YY", "student_number": "2015741049", "faculty": "전자정보공과대학", "major": "로봇학부", "phone": "010-7701-2854", "indate": "2020/02/29", "serial_number": "200101M2015741049", "student_id": 431, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 62, "room_name": "A0131B", "building": "A", "floor": "01", "room_number": "31", "seat": "B", "student_name": "김예찬", "term": "YY", "student_number": "2015732042", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-9445-8300", "indate": "2020/02/29", "serial_number": "200101M2015732042", "student_id": 172, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0132", "A": { "room_id": 63, "room_name": "A0132A", "building": "A", "floor": "01", "room_number": "32", "seat": "A", "student_name": "김광환", "term": "YY", "student_number": "E1251002", "faculty": "일반대학원", "major": "해당없음", "phone": "010-9614-9609", "indate": "2020/02/29", "serial_number": "200102ME1251002", "student_id": 82, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 64, "room_name": "A0132B", "building": "A", "floor": "01", "room_number": "32", "seat": "B", "student_name": "박재형", "term": "YY", "student_number": "2015707079", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-9889-4738", "indate": "2020/02/29", "serial_number": "200101M2015707079", "student_id": 349, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0133", "A": { "room_id": 65, "room_name": "A0133A", "building": "A", "floor": "01", "room_number": "33", "seat": "A", "student_name": "유정환", "term": "YY", "student_number": "2015742062", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-3609-8034", "indate": "2020/02/29", "serial_number": "200101M2015742062", "student_id": 554, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 66, "room_name": "A0133B", "building": "A", "floor": "01", "room_number": "33", "seat": "B", "student_name": "박준화", "term": "YY", "student_number": "2015508126", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-4827-8274", "indate": "2020/02/29", "serial_number": "200101M2015508126", "student_id": 362, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0134", "A": { "room_id": 67, "room_name": "A0134A", "building": "A", "floor": "01", "room_number": "34", "seat": "A", "student_name": "전인성", "term": "YY", "student_number": "2016706131", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-9661-5112", "indate": "2020/02/29", "serial_number": "200101M2016706131", "student_id": 761, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 68, "room_name": "A0134B", "building": "A", "floor": "01", "room_number": "34", "seat": "B", "student_name": "이태희", "term": "YY", "student_number": "2017742002", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-8729-0404", "indate": "2020/02/29", "serial_number": "200101M2017742002", "student_id": 695, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0135", "A": { "room_id": 69, "room_name": "A0135A", "building": "A", "floor": "01", "room_number": "35", "seat": "A", "student_name": "이주현", "term": "YY", "student_number": "2017742020", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-6450-4312", "indate": "2020/02/29", "serial_number": "200101M2017742020", "student_id": 671, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 70, "room_name": "A0135B", "building": "A", "floor": "01", "room_number": "35", "seat": "B", "student_name": "이대근", "term": "YY", "student_number": "2016802012", "faculty": "정책법학대학", "major": "행정학과", "phone": "010-2863-6322", "indate": "2020/02/29", "serial_number": "200101M2016802012", "student_id": 599, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0136", "A": { "room_id": 71, "room_name": "A0136A", "building": "A", "floor": "01", "room_number": "36", "seat": "A", "student_name": "서경덕", "term": "YY", "student_number": "2017741037", "faculty": "전자정보공과대학", "major": "로봇학부", "phone": "010-5216-6488", "indate": "2020/02/29", "serial_number": "200101M2017741037", "student_id": 409, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 72, "room_name": "A0136B", "building": "A", "floor": "01", "room_number": "36", "seat": "B", "student_name": "윤영석", "term": "YY", "student_number": "2018202070", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-2354-1858", "indate": "2020/02/29", "serial_number": "200101M2018202070", "student_id": 573, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0137", "A": { "room_id": 73, "room_name": "A0137A", "building": "A", "floor": "01", "room_number": "37", "seat": "A", "student_name": "김원규", "term": "YY", "student_number": "E1251001", "faculty": "일반대학원", "major": "해당없음", "phone": "010-6423-1430", "indate": "2020/02/29", "serial_number": "200102ME1251001", "student_id": 179, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 74, "room_name": "A0137B", "building": "A", "floor": "01", "room_number": "37", "seat": "B", "student_name": "박진영", "term": "YY", "student_number": "2016605042", "faculty": "자연과학대학", "major": "화학과", "phone": "010-4255-3372", "indate": "2020/02/29", "serial_number": "200101M2016605042", "student_id": 371, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0138", "A": { "room_id": 75, "room_name": "A0138A", "building": "A", "floor": "01", "room_number": "38", "seat": "A", "student_name": "김영우", "term": "YY", "student_number": "2017202011", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-3428-2271", "indate": "2020/02/29", "serial_number": "200101M2017202011", "student_id": 165, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 76, "room_name": "A0138B", "building": "A", "floor": "01", "room_number": "38", "seat": "B", "student_name": "장우현", "term": "YY", "student_number": "2017741009", "faculty": "전자정보공과대학", "major": "로봇학부", "phone": "010-2700-1683", "indate": "2020/02/29", "serial_number": "200101M2017741009", "student_id": 738, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0139", "A": { "room_id": 77, "room_name": "A0139A", "building": "A", "floor": "01", "room_number": "39", "seat": "A", "student_name": "추현석", "term": "YY", "student_number": "2017706076", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-4786-5222", "indate": "2020/02/29", "serial_number": "200101M2017706076", "student_id": 899, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 78, "room_name": "A0139B", "building": "A", "floor": "01", "room_number": "39", "seat": "B", "student_name": "정지원", "term": "YY", "student_number": "2017204055", "faculty": "소프트웨어융합대학", "major": "정보융합학부", "phone": "010-9325-4399", "indate": "2020/02/29", "serial_number": "200101M2017204055", "student_id": 798, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0140", "A": { "room_id": 79, "room_name": "A0140A", "building": "A", "floor": "01", "room_number": "40", "seat": "A", "student_name": "신상호", "term": "YY", "student_number": "2017706090", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-8993-5883", "indate": "2020/02/29", "serial_number": "200101M2017706090", "student_id": 465, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 80, "room_name": "A0140B", "building": "A", "floor": "01", "room_number": "40", "seat": "B", "student_name": "김민우", "term": "YY", "student_number": "2017117020", "faculty": "공과대학", "major": "건축공학과", "phone": "010-8335-3852", "indate": "2020/02/29", "serial_number": "200101M2017117020", "student_id": 116, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0141", "A": { "room_id": 81, "room_name": "A0141A", "building": "A", "floor": "01", "room_number": "41", "seat": "A", "student_name": "이선재", "term": "YY", "student_number": "2018117025", "faculty": "공과대학", "major": "건축공학과", "phone": "010-4286-1311", "indate": "2020/02/29", "serial_number": "200101M2018117025", "student_id": 616, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 82, "room_name": "A0141B", "building": "A", "floor": "01", "room_number": "41", "seat": "B", "student_name": "홍지범", "term": "YY", "student_number": "151260015", "faculty": "전자정보공과대학", "major": "전자재료공학과", "phone": "010-9178-2053", "indate": "2020/02/29", "serial_number": "200102M151260015", "student_id": 951, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0142", "A": { "room_id": 83, "room_name": "A0142A", "building": "A", "floor": "01", "room_number": "42", "seat": "A", "student_name": "박태준", "term": "YY", "student_number": "2016803069", "faculty": "정책법학대학", "major": "법학부", "phone": "010-5128-5985", "indate": "2020/02/29", "serial_number": "200101M2016803069", "student_id": 379, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 84, "room_name": "A0142B", "building": "A", "floor": "01", "room_number": "42", "seat": "B", "student_name": "김영웅", "term": "YY", "student_number": "2016707044", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-2468-9644", "indate": "2020/02/24", "serial_number": "200101M2016707044", "student_id": 166, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0143", "A": { "room_id": 85, "room_name": "A0143A", "building": "A", "floor": "01", "room_number": "43", "seat": "A", "student_name": "홍완기", "term": "YY", "student_number": "2017707077", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-7327-3427", "indate": "2020/02/29", "serial_number": "200101M2017707077", "student_id": 946, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 86, "room_name": "A0143B", "building": "A", "floor": "01", "room_number": "43", "seat": "B", "student_name": "박상현", "term": "YY", "student_number": "2017706135", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-9370-7589", "indate": "2020/02/29", "serial_number": "200101M2017706135", "student_id": 320, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0201", "A": { "room_id": 87, "room_name": "A0201A", "building": "A", "floor": "02", "room_number": "01", "seat": "A", "student_name": "최유종", "term": "YY", "student_number": "226110003", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-9188-1574", "indate": "2020/02/29", "serial_number": "200102M226110003", "student_id": 882, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 88, "room_name": "A0201B", "building": "A", "floor": "02", "room_number": "01", "seat": "B", "student_name": "정민서", "term": "YY", "student_number": "112290260", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-4258-3406", "indate": "2020/02/29", "serial_number": "200106M112290260", "student_id": 770, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0202", "A": { "room_id": 89, "room_name": "A0202A", "building": "A", "floor": "02", "room_number": "02", "seat": "A", "student_name": "소재민", "term": "YY", "student_number": "221260129", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-7485-1314", "indate": "2020/02/29", "serial_number": "200102M221260129", "student_id": 439, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 90, "room_name": "A0202B", "building": "A", "floor": "02", "room_number": "02", "seat": "B", "student_name": "이기운", "term": "YY", "student_number": "112290087", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-9019-6218", "indate": "2020/02/29", "serial_number": "200102M112290087", "student_id": 596, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0203", "A": { "room_id": 91, "room_name": "A0203A", "building": "A", "floor": "02", "room_number": "03", "seat": "A", "student_name": "박준명", "term": "YY", "student_number": "2019311039", "faculty": "인문사회과학대학", "major": "산업심리학과", "phone": "010-9877-1119", "indate": "2020/02/29", "serial_number": "200101M2019311039", "student_id": 359, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 92, "room_name": "A0203B", "building": "A", "floor": "02", "room_number": "03", "seat": "B", "student_name": "신용호", "term": "YY", "student_number": "2019202079", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-3101-4555", "indate": "2020/02/29", "serial_number": "200101M2019202079", "student_id": 468, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }, { "room": "A0204", "A": { "room_id": 93, "room_name": "A0204A", "building": "A", "floor": "02", "room_number": "04", "seat": "A", "student_name": "이영민", "term": "YY", "student_number": "2019707036", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-5214-6836", "indate": "2020/02/24", "serial_number": "200101M2019707036", "student_id": 640, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 }, "B": { "room_id": 94, "room_name": "A0204B", "building": "A", "floor": "02", "room_number": "04", "seat": "B", "student_name": "추승우", "term": "YY", "student_number": "154290162", "faculty": "전자정보공과대학", "major": "전자재료공학과", "phone": "010-3537-7075", "indate": "2020/02/29", "serial_number": "200102M154290162", "student_id": 898, "19_1": 0, "19_2": 0, "19_3": 0, "19_4": 0, "19_5": 0, "19_6": 0, "19_7": 0, "19_8": 0, "19_9": 0, "19_10": 0, "19_11": 0, "19_12": 0, "20_1": 0, "20_2": 0, "20_3": 0 } }
    ],
    studentList: [],
    studentTest: [
      { "student_id": 1, "student_name": " 안희범", "room_id": 31, "room_name": "A0116A", "seat": "A", "term": "YY", "student_number": "711150374", "faculty": "경영대학", "major": "경영학부", "phone": "010-4917-0346", "indate": "2020/02/29" }, { "student_id": 2, "student_name": "가조해", "room_id": null, "room_name": null, "seat": null, "term": "LY", "student_number": "M006", "faculty": "대학원생", "major": "", "phone": "", "indate": "2020/02/17" }, { "student_id": 3, "student_name": "갈삼흠", "room_id": 527, "room_name": "A0703A", "seat": "A", "term": "LY", "student_number": "2018202100", "faculty": "학부생", "major": "", "phone": "01023456257", "indate": "2020/02/11" }, { "student_id": 4, "student_name": "갈재함", "room_id": null, "room_name": null, "seat": null, "term": "LY", "student_number": "F018", "faculty": "교환학생", "major": "", "phone": "", "indate": "2020/02/17" }, { "student_id": 5, "student_name": "강강휘", "room_id": 531, "room_name": "A0705A", "seat": "A", "term": "LY", "student_number": "2019001003", "faculty": "어학연수생", "major": "", "phone": "", "indate": "2020/02/11" }, { "student_id": 6, "student_name": "강경대", "room_id": 195, "room_name": "A0312A", "seat": "A", "term": "YY", "student_number": "711150004", "faculty": "경영대학", "major": "경영학부", "phone": "010-8512-7825", "indate": "2020/02/29" }, { "student_id": 7, "student_name": "강동재", "room_id": 228, "room_name": "A0328B", "seat": "B", "term": "YY", "student_number": "711150310", "faculty": "경영대학", "major": "경영학부", "phone": "010-9396-6622", "indate": "2020/02/29" }, { "student_id": 8, "student_name": "강동호", "room_id": 159, "room_name": "A0237A", "seat": "A", "term": "LY", "student_number": "441280011", "faculty": "생활체육학과", "major": "", "phone": "010-2170-0557", "indate": "2020/02/29" }, { "student_id": 9, "student_name": "강민성", "room_id": 48, "room_name": "A0124B", "seat": "B", "term": "YY", "student_number": "2015706044", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-6231-4539", "indate": "2020/02/29" }, { "student_id": 10, "student_name": "강민혁", "room_id": 320, "room_name": "A0431B", "seat": "B", "term": "YY", "student_number": "2016742046", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-2380-5754", "indate": "2020/02/29" }, { "student_id": 11, "student_name": "강성민", "room_id": 199, "room_name": "A0314A", "seat": "A", "term": "YY", "student_number": "614290075", "faculty": "정책법학대학", "major": "행정학과", "phone": "010-2902-1278", "indate": "2020/02/29" }, { "student_id": 12, "student_name": "강수민", "room_id": 852, "room_name": "B0512B", "seat": "B", "term": "YY", "student_number": "331260346", "faculty": "공과대학", "major": "화학공학과", "phone": "010-8796-4454", "indate": "2020/02/29" }, { "student_id": 13, "student_name": "강수아", "room_id": 922, "room_name": "B0622B", "seat": "B", "term": "YY", "student_number": "2019202037", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-9113-3414", "indate": "2020/02/29" }, { "student_id": 14, "student_name": "강순혁", "room_id": 250, "room_name": "A0339B", "seat": "B", "term": "YY", "student_number": "161150186", "faculty": "전자정보공과대학", "major": "로봇학부", "phone": "010-3997-9425", "indate": "2020/02/29" }, { "student_id": 15, "student_name": "강안", "room_id": 976, "room_name": "B0723B", "seat": "B", "term": "LY", "student_number": "21089", "faculty": "신입생", "major": "", "phone": "010-5197-0921", "indate": "2020/02/17" }, { "student_id": 16, "student_name": "강용준", "room_id": 473, "room_name": "A0621A", "seat": "A", "term": "YY", "student_number": "161150080", "faculty": "전자정보공과대학", "major": "로봇학부", "phone": "010-2557-8480", "indate": "2020/02/29" }, { "student_id": 17, "student_name": "강윤규", "room_id": 96, "room_name": "A0205B", "seat": "B", "term": "YY", "student_number": "2019603043", "faculty": "자연과학대학", "major": "수학과", "phone": "010-5894-4565", "indate": "2020/02/29" }, { "student_id": 18, "student_name": "강자한", "room_id": 543, "room_name": "A0711A", "seat": "A", "term": "LY", "student_number": "2017203099", "faculty": "학부생", "major": "", "phone": "010-2988-3883", "indate": "2020/02/11" }, { "student_id": 19, "student_name": "강지수", "room_id": 660, "room_name": "B0112B", "seat": "B", "term": "YY", "student_number": "131150121", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-7334-9976", "indate": "2020/02/29" }, { "student_id": 20, "student_name": "강지은", "room_id": 763, "room_name": "B0318A", "seat": "A", "term": "YY", "student_number": "711260502", "faculty": "경영대학", "major": "경영학부", "phone": "010-7168-5505", "indate": "2020/02/29" }, { "student_id": 21, "student_name": "강지흔", "room_id": 982, "room_name": "B0726B", "seat": "B", "term": "YY", "student_number": "2017321045", "faculty": "인문사회과학대학", "major": "동북아문화산업학부", "phone": "010-3086-5953", "indate": "2020/02/24" }, { "student_id": 22, "student_name": "강철", "room_id": 508, "room_name": "A0638B", "seat": "B", "term": "YY", "student_number": "711250044", "faculty": "경영대학", "major": "경영학부", "phone": "010-4841-7315", "indate": "2020/02/29" }, { "student_id": 23, "student_name": "강태완", "room_id": 301, "room_name": "A0422A", "seat": "A", "term": "YY", "student_number": "2015726021", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-2592-6211", "indate": "2020/02/29" }, { "student_id": 24, "student_name": "강태웅", "room_id": 38, "room_name": "A0119B", "seat": "B", "term": "YY", "student_number": "211150189", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-2313-1184", "indate": "2020/02/29" }, { "student_id": 25, "student_name": "강현규", "room_id": 243, "room_name": "A0336A", "seat": "A", "term": "YY", "student_number": "2019323002", "faculty": "인문사회과학대학", "major": "미디어영상학부", "phone": "010-4670-2193", "indate": "2020/02/29" }, { "student_id": 26, "student_name": "강현서", "room_id": 278, "room_name": "A0410B", "seat": "B", "term": "YY", "student_number": "716110002", "faculty": "경영대학", "major": "경영학부", "phone": "010-3028-1697", "indate": "2020/02/29" }, { "student_id": 27, "student_name": "강현우", "room_id": 189, "room_name": "A0309A", "seat": "A", "term": "YY", "student_number": "2019706082", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-2314-6810", "indate": "2020/02/29" }, { "student_id": 28, "student_name": "강현준", "room_id": 277, "room_name": "A0410A", "seat": "A", "term": "YY", "student_number": "716110001", "faculty": "경영대학", "major": "경영학부", "phone": "010-2576-1697", "indate": "2020/02/29" }, { "student_id": 29, "student_name": "강희주", "room_id": 642, "room_name": "B0103B", "seat": "B", "term": "LY", "student_number": "2020381730", "faculty": "일반대학원", "major": "해당없음", "phone": "010-9053-9471", "indate": "2020/02/29" }, { "student_id": 30, "student_name": "강희지", "room_id": 868, "room_name": "B0520B", "seat": "B", "term": "YY", "student_number": "2017204026", "faculty": "소프트웨어융합대학", "major": "정보융합학부", "phone": "010-3259-1359", "indate": "2020/02/29" }, { "student_id": 31, "student_name": "계민이", "room_id": null, "room_name": null, "seat": null, "term": "LY", "student_number": "2018508142", "faculty": "학부생", "major": "", "phone": "01021858896", "indate": "2020/02/17" }, { "student_id": 32, "student_name": "고가현", "room_id": 787, "room_name": "B0405A", "seat": "A", "term": "YY", "student_number": "2019803021", "faculty": "인문사회과학대학", "major": "미디어영상학부", "phone": "010-5882-2387", "indate": "2020/02/29" }, { "student_id": 33, "student_name": "고건영", "room_id": 407, "room_name": "A0532A", "seat": "A", "term": "YY", "student_number": "2019117028", "faculty": "공과대학", "major": "건축공학과", "phone": "010-4032-1026", "indate": "2020/02/29" }, { "student_id": 34, "student_name": "고건우", "room_id": 472, "room_name": "A0620B", "seat": "B", "term": "YY", "student_number": "161150014", "faculty": "전자정보공과대학", "major": "로봇학부", "phone": "010-2402-5730", "indate": "2020/02/29" }, { "student_id": 35, "student_name": "고김한비", "room_id": 772, "room_name": "B0322B", "seat": "B", "term": "YY", "student_number": "624290124", "faculty": "정책법학대학", "major": "법학부", "phone": "010-9123-5928", "indate": "2020/02/29" }, { "student_id": 36, "student_name": "고미현", "room_id": 843, "room_name": "B0508A", "seat": "A", "term": "YY", "student_number": "2019803068", "faculty": "정책법학대학", "major": "법학부", "phone": "010-5670-3582", "indate": "2020/02/29" }, { "student_id": 37, "student_name": "고민범", "room_id": 316, "room_name": "A0429B", "seat": "B", "term": "YY", "student_number": "713290127", "faculty": "경영대학", "major": "경영학부", "phone": "010-4743-2343", "indate": "2020/02/29" }, { "student_id": 38, "student_name": "고수아", "room_id": 911, "room_name": "B0617A", "seat": "A", "term": "YY", "student_number": "2018802045", "faculty": "정책법학대학", "major": "행정학과", "phone": "010-3324-6837", "indate": "2020/02/29" }, { "student_id": 39, "student_name": "고승관", "room_id": 518, "room_name": "A0643B", "seat": "B", "term": "YY", "student_number": "2016706039", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-4245-3187", "indate": "2020/02/29" }, { "student_id": 40, "student_name": "고은아", "room_id": 783, "room_name": "B0403A", "seat": "A", "term": "YY", "student_number": "1271014", "faculty": "일반대학원", "major": "해당없음", "phone": "010-8641-6877", "indate": "2020/02/29" }, { "student_id": 41, "student_name": "고은정", "room_id": 883, "room_name": "B0603A", "seat": "A", "term": "YY", "student_number": "551150002", "faculty": "인문사회과학대학", "major": "동북아문화산업학부", "phone": "010-9004-6105", "indate": "2020/02/29" }, { "student_id": 42, "student_name": "고정현", "room_id": 443, "room_name": "A0606A", "seat": "A", "term": "YY", "student_number": "111210013", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-3055-8148", "indate": "2020/02/29" }, { "student_id": 43, "student_name": "고채린", "room_id": 793, "room_name": "B0408A", "seat": "A", "term": "YY", "student_number": "621170028", "faculty": "정책법학대학", "major": "법학부", "phone": "010-3776-4146", "indate": "2020/02/29" }, { "student_id": 44, "student_name": "고천예", "room_id": null, "room_name": null, "seat": null, "term": "LY", "student_number": "F016", "faculty": "교환학생", "major": "", "phone": "", "indate": "2020/02/17" }, { "student_id": 45, "student_name": "고태윤", "room_id": 165, "room_name": "A0240A", "seat": "A", "term": "LY", "student_number": "2019609029", "faculty": "생활체육학과", "major": "", "phone": "010-3559-9138", "indate": "2020/02/29" }, { "student_id": 46, "student_name": "고현지", "room_id": 814, "room_name": "B0418B", "seat": "B", "term": "YY", "student_number": "624290141", "faculty": "정책법학대학", "major": "법학부", "phone": "010-7531-2721", "indate": "2020/02/29" }, { "student_id": 47, "student_name": "공유빈", "room_id": 754, "room_name": "B0313B", "seat": "B", "term": "YY", "student_number": "112290236", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-5468-2711", "indate": "2020/02/29" }, { "student_id": 48, "student_name": "공호석", "room_id": 509, "room_name": "A0639A", "seat": "A", "term": "YY", "student_number": "2016321036", "faculty": "인문사회과학대학", "major": "동북아문화산업학부", "phone": "010-4675-8101", "indate": "2020/02/29" }, { "student_id": 49, "student_name": "구본관", "room_id": 221, "room_name": "A0325A", "seat": "A", "term": "YY", "student_number": "221250022", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-5621-9737", "indate": "2020/02/29" }, { "student_id": 50, "student_name": "권구현", "room_id": 187, "room_name": "A0308A", "seat": "A", "term": "YY", "student_number": "141190003", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-6433-2150", "indate": "2020/02/29" }, { "student_id": 51, "student_name": "권나연", "room_id": 731, "room_name": "B0302A", "seat": "A", "term": "YY", "student_number": "331150174", "faculty": "공과대학", "major": "화학공학과", "phone": "010-8808-3451", "indate": "2020/02/29" }, { "student_id": 52, "student_name": "권민석", "room_id": 167, "room_name": "A0241A", "seat": "A", "term": "LY", "student_number": "2018609037", "faculty": "생활체육학과", "major": "", "phone": "010-7204-5996", "indate": "2020/02/29" }, { "student_id": 53, "student_name": "권민지", "room_id": 700, "room_name": "B0211B", "seat": "B", "term": "YY", "student_number": "231260249", "faculty": "소프트웨어융합대학", "major": "정보융합학부", "phone": "010-4557-5827", "indate": "2020/02/29" }, { "student_id": 54, "student_name": "권석진", "room_id": 401, "room_name": "A0529A", "seat": "A", "term": "YY", "student_number": "2018742061", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-5331-4427", "indate": "2020/02/29" }, { "student_id": 55, "student_name": "권성민", "room_id": 602, "room_name": "A0740B", "seat": "B", "term": "YY", "student_number": "221170034", "faculty": "소프트웨어융합대학", "major": "소프트웨어학부", "phone": "010-6609-0766", "indate": "2020/02/29" }, { "student_id": 56, "student_name": "권성훈", "room_id": 15, "room_name": "A0108A", "seat": "A", "term": "YY", "student_number": "711150242", "faculty": "경영대학", "major": "경영학부", "phone": "010-8726-8418", "indate": "2020/02/29" }, { "student_id": 57, "student_name": "권수빈", "room_id": 641, "room_name": "B0103A", "seat": "A", "term": "LY", "student_number": "2020891430", "faculty": "경영대학", "major": "경영학부", "phone": "010-2478-8275", "indate": "2020/02/29" }, { "student_id": 58, "student_name": "권순영", "room_id": 497, "room_name": "A0633A", "seat": "A", "term": "YY", "student_number": "2015732067", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-8862-2851", "indate": "2020/02/24" }, { "student_id": 59, "student_name": "권순찬", "room_id": 368, "room_name": "A0512B", "seat": "B", "term": "YY", "student_number": "2016802036", "faculty": "정책법학대학", "major": "행정학과", "phone": "010-2265-2760", "indate": "2020/02/29" }, { "student_id": 60, "student_name": "권승완", "room_id": 451, "room_name": "A0610A", "seat": "A", "term": "YY", "student_number": "121150107", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-6220-2987", "indate": "2020/02/29" }, { "student_id": 61, "student_name": "권승훈", "room_id": 23, "room_name": "A0112A", "seat": "A", "term": "YY", "student_number": "111150252", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-5513-0541", "indate": "2020/02/29" }, { "student_id": 62, "student_name": "권영월", "room_id": null, "room_name": null, "seat": null, "term": "LY", "student_number": "F022", "faculty": "교환학생", "major": "", "phone": "", "indate": "2020/02/17" }, { "student_id": 63, "student_name": "권윤정", "room_id": 735, "room_name": "B0304A", "seat": "A", "term": "YY", "student_number": "111250061", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-2317-9499", "indate": "2020/02/29" }, { "student_id": 64, "student_name": "권은서", "room_id": 654, "room_name": "B0109B", "seat": "B", "term": "YY", "student_number": "611260034", "faculty": "정책법학대학", "major": "행정학과", "phone": "010-5152-1964", "indate": "2020/02/29" }, { "student_id": 65, "student_name": "권주원", "room_id": 388, "room_name": "A0522B", "seat": "B", "term": "YY", "student_number": "2018110205", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-3343-0351", "indate": "2020/02/29" }, { "student_id": 66, "student_name": "권진호", "room_id": 596, "room_name": "A0737B", "seat": "B", "term": "YY", "student_number": "424290092", "faculty": "자연과학대학", "major": "전자바이오물리학과", "phone": "010-8612-1543", "indate": "2020/02/29" }, { "student_id": 67, "student_name": "권택성", "room_id": 588, "room_name": "A0733B", "seat": "B", "term": "YY", "student_number": "421150049", "faculty": "자연과학대학", "major": "전자바이오물리학과", "phone": "010-2398-1297", "indate": "2020/02/29" }, { "student_id": 68, "student_name": "권형준", "room_id": 581, "room_name": "A0730A", "seat": "A", "term": "YY", "student_number": "2014405023", "faculty": "정책법학대학", "major": "법학부", "phone": "010-4170-8287", "indate": "2020/02/29" }, { "student_id": 69, "student_name": "기승준", "room_id": 377, "room_name": "A0517A", "seat": "A", "term": "YY", "student_number": "2017732071", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-8489-0963", "indate": "2020/02/29" }, { "student_id": 70, "student_name": "길진휘", "room_id": 625, "room_name": "AB107A", "seat": "A", "term": "YY", "student_number": "2018742041", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-5474-9089", "indate": "2020/02/29" }, { "student_id": 71, "student_name": "김가은", "room_id": 684, "room_name": "B0203B", "seat": "B", "term": "YY", "student_number": "131150016", "faculty": "전자정보공과대학", "major": "전자융합공학과", "phone": "010-3248-3251", "indate": "2020/02/29" }, { "student_id": 72, "student_name": "김가은", "room_id": 863, "room_name": "B0518A", "seat": "A", "term": "YY", "student_number": "711260115", "faculty": "경영대학", "major": "경영학부", "phone": "010-4064-2563", "indate": "2020/02/29" }, { "student_id": 73, "student_name": "김강민", "room_id": 439, "room_name": "A0604A", "seat": "A", "term": "YY", "student_number": "111150303", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-3104-9416", "indate": "2020/02/29" }, { "student_id": 74, "student_name": "김건", "room_id": 366, "room_name": "A0511B", "seat": "B", "term": "YY", "student_number": "2018317024", "faculty": "인문사회과학대학", "major": "미디어영상학부", "phone": "010-9362-7935", "indate": "2020/02/24" }, { "student_id": 75, "student_name": "김건동", "room_id": 183, "room_name": "A0306A", "seat": "A", "term": "YY", "student_number": "151150116", "faculty": "전자정보공과대학", "major": "전자재료공학과", "phone": "010-3207-7015", "indate": "2020/02/29" }, { "student_id": 76, "student_name": "김건우", "room_id": 352, "room_name": "A0504B", "seat": "B", "term": "YY", "student_number": "2016734077", "faculty": "전자정보공과대학", "major": "전자재료공학과", "phone": "010-2254-6395", "indate": "2020/02/29" }, { "student_id": 77, "student_name": "김경민", "room_id": 463, "room_name": "A0616A", "seat": "A", "term": "YY", "student_number": "141250030", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-5619-5332", "indate": "2020/02/29" }, { "student_id": 78, "student_name": "김경민", "room_id": 478, "room_name": "A0623B", "seat": "B", "term": "YY", "student_number": "2015114015", "faculty": "공과대학", "major": "화학공학과", "phone": "010-3489-8223", "indate": "2020/02/29" }, { "student_id": 79, "student_name": "김경주", "room_id": 669, "room_name": "B0117A", "seat": "A", "term": "YY", "student_number": "141150025", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-8986-3234", "indate": "2020/02/29" }, { "student_id": 80, "student_name": "김고은", "room_id": 904, "room_name": "B0613B", "seat": "B", "term": "YY", "student_number": "2018605046", "faculty": "자연과학대학", "major": "화학과", "phone": "010-3331-0194", "indate": "2020/02/29" }, { "student_id": 81, "student_name": "김광현", "room_id": 101, "room_name": "A0208A", "seat": "A", "term": "YY", "student_number": "621150105", "faculty": "정책법학대학", "major": "법학부", "phone": "010-2202-4325", "indate": "2020/02/29" }, { "student_id": 82, "student_name": "김광환", "room_id": 63, "room_name": "A0132A", "seat": "A", "term": "YY", "student_number": "E1251002", "faculty": "일반대학원", "major": "해당없음", "phone": "010-9614-9609", "indate": "2020/02/29" }, { "student_id": 83, "student_name": "김기민", "room_id": 813, "room_name": "B0418A", "seat": "A", "term": "YY", "student_number": "531150462", "faculty": "인문사회과학대학", "major": "미디어영상학부", "phone": "010-9279-8415", "indate": "2020/02/29" }, { "student_id": 84, "student_name": "김기용", "room_id": 113, "room_name": "A0214A", "seat": "A", "term": "YY", "student_number": "321150026", "faculty": "공과대학", "major": "건축공학과", "phone": "010-6635-2915", "indate": "2020/02/29" }, { "student_id": 85, "student_name": "김나은", "room_id": 773, "room_name": "B0323A", "seat": "A", "term": "YY", "student_number": "2019323066", "faculty": "인문사회과학대학", "major": "미디어영상학부", "phone": "010-3321-8590", "indate": "2020/02/29" }, { "student_id": 86, "student_name": "김나현", "room_id": 882, "room_name": "B0602B", "seat": "B", "term": "YY", "student_number": "151150062", "faculty": "전자정보공과대학", "major": "전자재료공학과", "phone": "010-7195-2953", "indate": "2020/02/29" }, { "student_id": 87, "student_name": "김나현", "room_id": 890, "room_name": "B0606B", "seat": "B", "term": "YY", "student_number": "2017116026", "faculty": "공과대학", "major": "환경공학과", "phone": "010-9370-4261", "indate": "2020/02/29" }, { "student_id": 88, "student_name": "김낙현", "room_id": 349, "room_name": "A0503A", "seat": "A", "term": "YY", "student_number": "2016734006", "faculty": "전자정보공과대학", "major": "전자재료공학과", "phone": "010-8753-2803", "indate": "2020/02/29" }, { "student_id": 89, "student_name": "김남서", "room_id": 324, "room_name": "A0433B", "seat": "B", "term": "YY", "student_number": "624290062", "faculty": "정책법학대학", "major": "법학부", "phone": "010-2400-0623", "indate": "2020/02/29" }, { "student_id": 90, "student_name": "김다리야", "room_id": 943, "room_name": "B0707A", "seat": "A", "term": "LY", "student_number": "2018804033", "faculty": "학부생", "major": "", "phone": "01068699029", "indate": "2020/02/11" }, { "student_id": 91, "student_name": "김다연", "room_id": 652, "room_name": "B0108B", "seat": "B", "term": "YY", "student_number": "231150019", "faculty": "소프트웨어융합대학", "major": "정보융합학부", "phone": "010-9082-5391", "indate": "2020/02/29" }, { "student_id": 92, "student_name": "김다영", "room_id": 664, "room_name": "B0114B", "seat": "B", "term": "YY", "student_number": "321150149", "faculty": "공과대학", "major": "건축공학과", "phone": "010-4921-8706", "indate": "2020/02/29" }, { "student_id": 93, "student_name": "김다은", "room_id": 811, "room_name": "B0417A", "seat": "A", "term": "YY", "student_number": "2019610004", "faculty": "자연과학대학", "major": "전자바이오물리학과", "phone": "010-8914-9434", "indate": "2020/02/29" }, { "student_id": 94, "student_name": "김대환", "room_id": 449, "room_name": "A0609A", "seat": "A", "term": "YY", "student_number": "121150001", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-5353-7827", "indate": "2020/02/29" }, { "student_id": 95, "student_name": "김도연", "room_id": 779, "room_name": "B0401A", "seat": "A", "term": "YY", "student_number": "2018803050", "faculty": "정책법학대학", "major": "법학부", "phone": "010-8610-6547", "indate": "2020/02/29" }, { "student_id": 96, "student_name": "김도현", "room_id": 611, "room_name": "A0745A", "seat": "A", "term": "YY", "student_number": "2019605024", "faculty": "자연과학대학", "major": "화학과", "phone": "010-9358-5290", "indate": "2020/02/29" }, { "student_id": 97, "student_name": "김동엽", "room_id": 610, "room_name": "A0744B", "seat": "B", "term": "YY", "student_number": "2019323028", "faculty": "인문사회과학대학", "major": "미디어영상학부", "phone": "010-7400-7076", "indate": "2020/02/29" }, { "student_id": 98, "student_name": "김동완", "room_id": 404, "room_name": "A0530B", "seat": "B", "term": "YY", "student_number": "2019732001", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-3994-6943", "indate": "2020/02/29" }, { "student_id": 99, "student_name": "김동우", "room_id": 280, "room_name": "A0411B", "seat": "B", "term": "YY", "student_number": "151250017", "faculty": "전자정보공과대학", "major": "전자재료공학과", "phone": "010-5198-6927", "indate": "2020/02/29" }, { "student_id": 100, "student_name": "김동욱", "room_id": 521, "room_name": "A0645A", "seat": "A", "term": "YY", "student_number": "2016707002", "faculty": "전자정보공과대학", "major": "전자통신공학과", "phone": "010-4651-5169", "indate": "2020/02/29" }, { "student_id": 101, "student_name": "김동현", "room_id": 115, "room_name": "A0215A", "seat": "A", "term": "YY", "student_number": "111150234", "faculty": "전자정보공과대학", "major": "전자공학과", "phone": "010-4465-9596", "indate": "2020/02/29" }, { "student_id": 102, "student_name": "김동현", "room_id": 118, "room_name": "A0216B", "seat": "B", "term": "YY", "student_number": "211170015", "faculty": "소프트웨어융합대학", "major": "컴퓨터정보공학부", "phone": "010-2955-3130", "indate": "2020/02/29" }, { "student_id": 103, "student_name": "김동현", "room_id": 400, "room_name": "A0528B", "seat": "B", "term": "YY", "student_number": "2018741024", "faculty": "전자정보공과대학", "major": "로봇학부", "phone": "010-2210-5392", "indate": "2020/02/29" }, { "student_id": 104, "student_name": "김동환", "room_id": 211, "room_name": "A0320A", "seat": "A", "term": "LY", "student_number": "2016508112", "faculty": "경영대학", "major": "경영학부", "phone": "010-3103-7914", "indate": "2020/02/24" }, { "student_id": 105, "student_name": "김동훈", "room_id": 302, "room_name": "A0422B", "seat": "B", "term": "YY", "student_number": "2016732018", "faculty": "전자정보공과대학", "major": "전기공학과", "phone": "010-3529-8905", "indate": "2020/02/29" }, { "student_id": 106, "student_name": "김량현", "room_id": 742, "room_name": "B0307B", "seat": "B", "term": "YY", "student_number": "431150097", "faculty": "자연과학대학", "major": "화학과", "phone": "010-2740-2276", "indate": "2020/02/29" }, { "student_id": 107, "student_name": "김마리나", "room_id": 944, "room_name": "B0707B", "seat": "B", "term": "LY", "student_number": "2018804034", "faculty": "학부생", "major": "", "phone": "01076364515", "indate": "2020/02/11" }, { "student_id": 108, "student_name": "김무성", "room_id": 468, "room_name": "A0618B", "seat": "B", "term": "YY", "student_number": "536110009", "faculty": "인문사회과학대학", "major": "미디어영상학부", "phone": "010-7410-6176", "indate": "2020/02/29" }
    ],
    defIndex: {
      roomArr: [],
      studentArr: []
    },
    testIndex: [],
    dbSearch: [],
    admin: {
      modal: 'db',
        // index  db  refg  user
      db: {
        options: DBoptions,
        optionKeys: Object.keys(DBoptions),
        keyword:'',
      },
      loadingState: 0
    },
    
    theme: {
      applied: styles["colors"][defaultColor],
      colorKeys: Object.keys(styles.colors),
      colors: styles.colors
    },

    alert: null,

  },
  getters: {

  },
  mutations: {

    //___________ AUTHENTICATION METHODS _______
    async LOGIN (state, {data}) {
      console.log('$$$ request ...$mutation/LOGIN');
      state.auth.id = data.id;
      localStorage.id = data.id;
      state.auth.userName = data.config.userName;
      localStorage.userName = data.config.userName;
      state.theme.applied = styles["colors"][data.config.colorConfig];
      localStorage.colorConfig = data.config.colorConfig;
      console.log('$$$ state loaded ...$mutation/LOGIN');

      const verification = await axios.post('/auth/verify', {id:data.id});
      state.auth.accessLevel = verification.data.accessLevel;
      console.log('$$$ access verified ...$mutation/LOGIN');
    },

    VERIFIED (state, {data}) {
      console.log("$$$ request ...$mutation/VERIFIED");
      console.log(data);
      state.auth.accessLevel = data.accessLevel;
    },



    RECOVER (state) {
      console.log('$$$ request ...$mutation/RECOVER');
      state.auth.id = localStorage.id;
      state.auth.userName = localStorage.userName;
      state.theme.applied = styles["colors"][localStorage.colorConfig];
    },

    LOGOUT (state) {
      console.log('$$$ request ...$mutation/LOGOUT');
      state.auth.accessLevel = 0;
      state.auth.id = null;
      state.auth.userName = null;
      state.theme.applied = styles["colors"][defaultColor];
      delete localStorage.id ;
      delete localStorage.userName ;
      localStorage.colorConfig = defaultColor;
    },


    //______________ DB METHODS ____________

    async DB_INFO (state) {
      console.log('$$$ request ...$mutation/DB_INFO');
      let {data} = await axios.get('/db/info');
      state.dbinfo = data;
      console.log('$$$ dbinfo loaded ...$mutation/DB_INFO');
      console.log(data);
    },

    async DB_COMMIT (state) {
      console.log('$$$ request ... $mutation/DB_COMMIT');
      let {data} = await axios.get('/db/info/commit');
      state.info.commit = data.commit;
    },

    async LOAD_ROOM_LIST (state) {
      console.log('$$$ request ...$mutation/LOAD_ROOM_LIST');
      let dataArr = []; 
      let obj, name; let count = 0;
      let {data} = await axios.get('/db/room-list');
      for(var i=0; i < data.arg.length; i++) {
        if(count){ // count: 1
          obj.B = data["arg"][i];
          dataArr.push(obj);
          count = 0;
        }else{ // count: 0
          name = data["arg"][i]["room_name"];
          name = name.slice(0, -1);
          obj = {
            "name": name,
            "A": data["arg"][i],
            "B": {}
          };
          count = 1;
        }
      }
      let indexArr = [];
      for(var j=0; j < data.arg.length/2; j++) {
        indexArr.push(j);
      }
      state.defIndex.roomArr = indexArr;
      state.roomList = dataArr;
    },

    async LOAD_STUDENT_LIST (state) {
      console.log('$$$ request ...$mutation/LOAD_STUDENT_LIST');
      let indexArr = [];
      let {data} = await axios.get('/db/student-list');
      for(var i=0; i < data.arg.length; i++){
        indexArr.push(i);
      }
      state.defIndex.studentArr = indexArr;
      state.studentList = data.arg;
    },
    

    //______________ SEARCH METHODS ____________

    async SEARCH (state, keyword) {
      console.log('$$$ request ...$mutation/SEARCH');
      state.search.loadingState = 1;
      let {data} = await axios.post('/db/search', {keyword});
      state.searchArr = data.arg;
    },

    async SEARCH_room (state, keyword) {
      if(keyword === ''){
        console.log('$$$ ALL ROOM LIST ...$mutation/SEARCH_room');
        state.dbSearch = state.defIndex.roomArr;
      }else{
        console.log('$$$ request ...$mutation/SEARCH_room');
        state.admin.loadingState = 1;
        let Arr = [];
        let calc0, calc1, raw;
        let {data} = await axios.post('/db/search/room', {keyword});
        for(var j=0; j < data.arg.length; j++){
          raw = (data["arg"][j]["room_id"]);
          calc1 = parseInt(raw/2) + raw%2 - 1;
          if(calc0 !== calc1){
            Arr.push(calc1);
          }calc0 = calc1;
        }
        state.dbSearch = Arr;
      }
    },
    
    async SEARCH_student (state, keyword) {
      if(keyword === ''){
        console.log('$$$ ALL STUDENT LIST ...$mutation/SEARCH_student');
        state.dbSearch = state.defIndex.studentArr;
      }else{
        console.log('$$$ request ...$mutation/SEARCH_room');
        state.admin.loadingState = 1;
        let Arr = [];
        let {data} = await axios.post('/db/search/student', {keyword});
        for(var i=0; i < data.arg.length; i++){
          Arr.push(data["arg"][i]["student_id"]);
        }
        state.dbSearch = Arr;
      }
    },

    SEARCH_test (state) {
      let Arr = [];
      for(var i=0; i<state.roomTest.length; i++){
        Arr.push(i);
      }
      state.testIndex = Arr;
    },





    //____________ UI METHODS ____________
    CHANGE_THEME (state, {color}) {
      console.log('$$$ request ...$mutation/CHANGE_THEME');
      console.log(color);
      state.theme.applied = styles["colors"][color];
      localStorage.colorConfig = color;
      axios.post('/auth/theme/change', {id: localStorage.id, color});
      console.log('$$$ colorCofig updated ...$mutation/CHANGE_THEME');
    },
    TOGGLE(state, {target, set}) {
      state[target] = set;
    },

    searchCoverBottom(state) {
      state.search.coverBottom.height = "calc(100% - " + String(state.searchArr.length * state.search.recordHeight) + "px)";
    },

    searchLoadingState(state, bool){
      state.search.loadingState = bool;
      console.log('loading: ', bool);
    },
  
    ALERT (state, msg) {
      console.log(msg);
      state.alert = msg;
    },



  },
  actions: {
    //___________ AUTHENTICATION METHODS _______
    async LOGIN ({commit}, identity) {
      console.log("$$$ request ...$action/LOGIN");
      let {data} = await axios.post('auth/login', identity);
      if (data.accessToken) {
        console.log("$$$ token issued ...$action/LOGIN");
        axios.defaults.headers.common['Authorization'] = data.accessToken;
        commit('LOGIN', {data});
      }else{
        console.log("$$$ something wrong ...$action/LOGIN");
      }
    },

    async VERIFY ({commit}) {
      console.log("$$$ request ...$action/VERIFY");
      const {data} = await axios.post('/auth/verify', {id: localStorage.id});
      if(data.accessLevel){
        console.log('$$$ access verified ...$action/VERIFY');
        commit('VERIFIED', {data});
      }else{
        commit('ALERT', 'VERIFICATION FAILED (401)')
      }
    },
    DEPOSIT () {
      axios.post('/auth/deposit', {id: localStorage.id});
    },

    async RECOVER ({commit}) {
      console.log('$$$ request ...$action/RECOVER');
      const {data} = await axios.post('/auth/recover', {id:localStorage.id});
      if(data.accessToken){
        console.log('$$$ accessToken detected ...$action/RECOVER');
        axios.defaults.headers.common['Authorization'] = data.accessToken;
        commit('RECOVER');
      }else{
        console.log('$$$ no recieved accessToken from deposit object ...$action/RECOVER');
      }
    },

    LOGOUT ({commit}) {
      console.log("$$$ request ...$action/LOGOUT");
      axios.post('/auth/logout', {id: localStorage.id});
      axios.defaults.headers.common['Authorization'] = undefined;
      commit('LOGOUT');
    },


  }
})